Revit 2027 API
View.IsElementVisibleInTemporaryViewMode Method
 Identifies if the input element is visible for the temporary view mode for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsElementVisibleInTemporaryViewMode(
	TemporaryViewMode mode,
	ElementId id
)
Public Function IsElementVisibleInTemporaryViewMode (
	mode As TemporaryViewMode,
	id As ElementId
) As Boolean
public:
bool IsElementVisibleInTemporaryViewMode(
	TemporaryViewMode mode,
	ElementId^ id
)
member IsElementVisibleInTemporaryViewMode :
        mode : TemporaryViewMode *
        id : ElementId -> bool
Parameters
mode TemporaryViewMode
 The temporary view mode. Only TemporaryHideIsolate and AnalyticalModel modes are supported by this option. Other modes will result in an exception.
id ElementId
 The element id.
Return Value
Boolean
 True if the element is visible, false if the element is hidden in the view mode.
Exceptions
Exception | Condition
ArgumentException |  This view mode is not supported for checking element visibility.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
View Class
Autodesk.Revit.DB Namespace